title: Excessive Failed Cisco AnyConnect Secure Mobility Client VPN Login Attempts
id: 12345678-9abc-def0-1234-56789abcdef0
status: experimental
description: Detects more than 3 failed login attempts on Cisco AnyConnect Secure Mobility Client
author: Jacob Stickney
date: 2024/06/20
modified: 2024/06/20
tags:
    - attack.initial_access
    - attack.ta0001
    - attack.lateral_movement
    - attack.ta0008
    - attack.defense_evasion
    - attack.ta0005
    - attack.persistence
    - attack.ta0003
    - attack.privilege_escalation
    - attack.ta0004
    - attack.valid_accounts
    - attack.t1078
logsource:
  product: cisco
  service: vpn # Will need to further specify the SIEM index name per your environment
detection:
  failed_login:
    EventID: '4625'
    timeframe: 10m
    ResultDescription: 'An account failed to log on.'
  condition: failed_login
falsepositives:
  - A legitimate user entering incorrect credentials by mistake
level: high


