title: Excessive Failed Cisco AnyConnect Secure Mobility Client VPN Login Attempts
id: 12345678-9abc-def0-1234-56789abcdef0
status: experimental
description: Detects excessive failed login attempts on Cisco AnyConnect Secure Mobility Client. Adversaries may leverage external-facing remote services to initially access and/or persist within a network. Remote services such as VPNs, Citrix, and other access mechanisms allow users to connect to internal enterprise network resources from external locations.
references: 
    - https://www.cisco.com/c/en/us/support/security/anyconnect-secure-mobility-client/series.html
    - https://attack.mitre.org/techniques/T1133/
author: Jacob Stickney
date: 2024/06/20
modified: 2024/06/20
tags:
    - attack.initial_access
    - attack.ta0001
    - attack.lateral_movement
    - attack.ta0008
    - attack.defense_evasion
    - attack.ta0005
    - attack.persistence
    - attack.ta0003
    - attack.privilege_escalation
    - attack.ta0004
    - attack.valid_accounts
    - attack.t1078
    - attack.external_remote_services
    - attack.t1133
logsource:
  product: cisco
  service: vpn # Will need to further specify the SIEM index name per your environment
detection:
  failed_login:
    EventID: '4625'
    timeframe: 10m
    ResultDescription: 'An account failed to log on.'
    threshold: 3
  condition: failed_login
falsepositives:
  - A legitimate user entering incorrect credentials by mistake
level: high


